benchmark/4_TTL_PreCache/RENDER/POST/post_output_100conn_10s.txt
Running 10s test @ https://url-shortener-pbhq.onrender.com
  100 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.07s   480.05ms   1.95s    61.17%
    Req/Sec     0.79      1.40     5.00     81.40%
  855 requests in 10.07s, 502.65KB read
Requests/sec:     84.89
Transfer/sec:     49.91KB