benchmark/4_TTL_PreCache/RENDER/POST/post_output_10conn_10s.txt
Running 10s test @ https://url-shortener-pbhq.onrender.com
  10 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   239.33ms   97.60ms 714.08ms   86.70%
    Req/Sec     4.78      2.07    10.00     78.47%
  418 requests in 10.02s, 245.74KB read
Requests/sec:     41.72
Transfer/sec:     24.53KB